{
  "backend/main.mo": "Motoko backend storing and managing route metadata with authorization checks and CRUD/query functions for routes.",
  "feature_evidence.json": "Feature evidence report linking gameplay features to source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files including game world, truck, UI panels, and route systems.",
  "frontend/index.css": "Empty stylesheet placeholder for frontend global styles.",
  "frontend/index.html": "Basic HTML page bootstrapping the React app and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Top-level React app managing game mode, route loading, panels, and UI layout.",
  "frontend/src/components/auth/AuthStatusBar.tsx": "Auth status component showing sign‑in state and hosting the login/logout button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication with loading and error recovery.",
  "frontend/src/game/audio/useDrivingAudio.ts": "React hook that initializes and updates Web Audio oscillators to simulate engine and road sounds based on speed and acceleration.",
  "frontend/src/game/camera/FollowCamera.tsx": "Three.js camera component that smoothly follows a truck with different offsets and behavior depending on game mode.",
  "frontend/src/game/GameView.tsx": "Main 3D scene combining world geometry, truck, camera, audio, NPC traffic, and route visualization.",
  "frontend/src/game/routes/ActiveRouteState.ts": "Zustand store tracking the active route, current waypoint, and distance updates as the truck moves.",
  "frontend/src/game/routes/RouteCreatorState.ts": "Zustand store managing draft route creation, including waypoint CRUD, reordering, metadata, and validation.",
  "frontend/src/game/routes/RouteEditorPanel.tsx": "UI panel for editing and saving custom routes, handling waypoint management, metadata input, and persistence.",
  "frontend/src/game/routes/RoutesPanel.tsx": "UI panel listing saved routes with load and delete actions, showing metadata and author-based permissions.",
  "frontend/src/game/routes/RouteVisualizer.tsx": "Three.js component rendering waypoint markers and a smoothed path line for a route, highlighting progress states.",
  "frontend/src/game/traffic/NpcTraffic.tsx": "Creates and updates NPC cars with deterministic randomness, moving them relative to the player's truck and rendering them with instancing plus individual models.",
  "frontend/src/game/ui/HUD.tsx": "Displays driving HUD elements such as speed, controls help, audio toggle, and route info based on game mode and truck state.",
  "frontend/src/game/utils/deterministicRandom.ts": "Implements a simple deterministic LCG-based random number generator with float and integer helpers.",
  "frontend/src/game/vehicle/Truck.tsx": "Defines a controllable truck with keyboard input, physics-like movement, and exposes state via an imperative handle.",
  "frontend/src/game/world/GasStop.tsx": "Renders a detailed gas station scene with textured canopy, pumps, pillars, and signage.",
  "frontend/src/game/world/HighwayAndBridge.tsx": "Builds a highway and bridge environment using textured road surfaces, lane markings, guardrails, and structural supports.",
  "frontend/src/game/world/PowerLines.tsx": "Generates utility poles with textures, random variations, and optional guy wires, then renders them along with overhead cables.",
  "frontend/src/game/world/World.tsx": "Builds the main world scene including textured ground, road, lane markings, and environment features like power lines, highway, and gas station.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing related queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and handling login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for fetching, saving, and deleting route data via the backend actor.",
  "frontend/src/index.css": "Sets global Tailwind-based styling and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers and renders the root component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, typography, animations, and plugin integrations for the frontend styling system.",
  "project_state.json": "Defines the project state, including goals for realistic road environments, required images, and a list of existing features and requirements."
}