{
  "kind": "build_request",
  "title": "Expand driving world: infinite drivable highways/bridges, construction events, cities/rest stops, cab camera, and walk mode",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the forced truck reset/teleport behavior so the player can continuously drive without being snapped back to a previous location/position.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "stop making go back to where you where just let me drive"
        ]
      },
      "acceptanceCriteria": [
        "While in Drive Mode, the truck is never automatically repositioned back to the origin (0,1,0) based on distance traveled.",
        "The previous reset logic in the truck update loop is removed/disabled, and continuous driving works for several minutes without teleporting."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement an infinite (endless) highway/road system so the drivable roadway extends continuously in the direction of travel (no visible end), while keeping performance stable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "make highways infinite"
        ]
      },
      "acceptanceCriteria": [
        "The roadway appears endless by reusing/repositioning road/highway segments as the player advances.",
        "There is no visible “end of road” within normal viewing distance while driving straight for an extended time.",
        "Frame rate remains stable (no unbounded growth in meshes/objects as distance increases)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make bridges/overpasses actually drivable by adding a drivable surface/collision/height-following so the truck can drive onto and across bridge decks (including elevated roadway sections).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "make highways realistic you can drive on bridges also"
        ]
      },
      "acceptanceCriteria": [
        "At least one bridge deck in the world is reachable from a roadway connection (e.g., an approach/ramp) and can be driven across.",
        "When the truck is on the bridge deck, its Y position aligns to the deck height (no floating below the deck, no falling through).",
        "Route-creator ground clicking still works (drivable/collider meshes do not break waypoint placement interactions)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add occasional randomized 'construction ahead' road events that spawn sometimes while driving, such as warning signs, cones/barrels, lane closures, and/or barriers placed on/near the roadway.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add  construction on road ahead sometimes"
        ]
      },
      "acceptanceCriteria": [
        "While driving forward, the player periodically encounters a construction setup ahead (not constant; appears sometimes).",
        "Construction props are positioned relative to the road/highway so they read clearly as a roadwork zone.",
        "Construction props recycle with the infinite road system (they do not accumulate infinitely in memory)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add random power stations/substations as roadside landmarks distributed throughout the world (more than just power lines), with placement that feels believable along the highway/road.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add power stations all over random"
        ]
      },
      "acceptanceCriteria": [
        "Multiple power station/substation landmarks are visible in different locations while driving.",
        "Power stations are placed off the main drivable lane (no blocking the primary roadway by default).",
        "Placement is stable during a session (no rapid popping/flickering at the same location)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add city areas as recognizable clusters (e.g., skyline blocks/building groups) that appear along the drive so the world includes cities/towns the player can drive near/through.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add city's"
        ]
      },
      "acceptanceCriteria": [
        "At least one city cluster is visible from the roadway and feels distinct from scattered roadside props (dense buildings vs. random boxes).",
        "City clusters integrate with the infinite driving approach (repeat/reposition without infinite accumulation)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Add semi-truck-only rest stops (truck stops) as world locations, including visible signage indicating trucks/semi parking only and features like parking bays suitable for a semi-truck.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add rest stop only for semis"
        ]
      },
      "acceptanceCriteria": [
        "At least one rest stop/truck stop location exists near the highway/road with a clear 'TRUCKS ONLY' / 'TRUCK PARKING' style sign (English text).",
        "The rest stop includes space that visually fits a semi (wider bays/longer pull-through) and is reachable from the drivable road network."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add a switchable seat-view (cab/driver) camera mode that the player can toggle while driving, in addition to the existing follow/chase camera.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add seat view camera to switch to"
        ]
      },
      "acceptanceCriteria": [
        "A new 'Cab/Seat View' camera mode exists and can be toggled on/off during Drive Mode (via a HUD button and/or a keybind).",
        "Cab view places the camera inside/near the truck cab with an appropriate forward-looking angle.",
        "Switching camera modes is smooth and does not break driving controls or HUD speed display."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add a walk mode that the player can enter/exit, with keyboard controls for walking movement (forward/back/left/right) using W/A/S/D and arrow keys, and update the on-screen controls help to reflect walk controls when active.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add walk mode e left right y or use keyboard arrows forward w backward f add"
        ]
      },
      "acceptanceCriteria": [
        "The app supports a Walk Mode distinct from Drive Mode (player is on-foot instead of controlling the truck).",
        "In Walk Mode, the player can move using W/ArrowUp (forward), S/ArrowDown (backward), A/ArrowLeft (left), D/ArrowRight (right).",
        "The HUD controls help changes based on the active mode to show the correct keys for walking vs driving.",
        "Entering/exiting Walk Mode does not cause teleport resets like the previous bug, and does not break Route Creator mode behavior."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add a more clearly 'semi truck' vehicle option/variant for the player (semi tractor + trailer styling), while keeping existing driving controls and the imperative truck state interface used by camera/HUD/audio.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "add semi Ur truck"
        ]
      },
      "acceptanceCriteria": [
        "The player’s vehicle reads more clearly as a semi-truck (tractor-trailer proportions/details) compared to the current model.",
        "Driving controls remain the same (W/A/S/D + arrow keys) and the camera/HUD/audio continue to function using the truck ref/state.",
        "If a selection/toggle is added, it is accessible in the UI without breaking existing gameplay modes."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be modified: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep all backend logic in the existing single Motoko actor (backend/main.mo); do not introduce additional backend services.",
    "Do not break Route Creator ground-click waypoint placement when adding drivable/collider meshes or new world props."
  ],
  "nonGoals": [
    "Adding multiplayer/real-time driving or networking.",
    "Integrating third-party map/GPS services or real-world map data.",
    "Implementing full physics simulation (suspension, tire friction models) beyond simple height-following needed for drivable bridges."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}